<?php
function data(){// 배열 안의 단어를 인식하면 인덱스가 출력되도록 함수설계
  $info["시간표"]=array("시간표","강의","수업");
  $info["복사점"]=array("복사점","복사");
  $info["빈강의실"]=array("강의실","빈강의실","빈","공부할 곳","김광실","빈강","빙강");
  $info["놀이문화센터"]=array("놀","놀거리","노래","노래방","놀이","놀이문화센터","보드","보드게임","스케이트","자전거","배드민턴","게임","야구","글러브","야구글러브",
                            "심심해","노래방");
  // $info["먹거리"]=array("먹거리","먹을");
  $info["무인프린트"]=array("프린트");
  $info["복지시설"]=array("복지","회관","문화","영화관","영화","주차관리소","주차관리","주차","관리","관리소","복사점","서점","우체국","문화","안경점","플스방",
  "신한","은행","신한은행","사진","사진관","휴대폰","휴대폰매장","유학사","유학","문방구","미용","미용실","보건소","보건");
  $info["음식점"]=array("식당","학식","음식점","배고파","교직원","학생","생활원","생활원식당","기식","카페테리아","샹차이","포썸","쌀국수","포썸쌀국수","봉구스","밥버거","봉구스밥버거","쉐푸드",
                "샐러디","고기","토마토","도시락","버거","멜팅","멜팅버거","햄버거","공씨네","주먹밥","김밥","팔뚝","팔뚝김밥","스낵바","먹을","짜장면","짬뽕","탕수육","밥버거","덮밥","샐러드","고기","삼겹살","고집","도시락"
                ,"주스","주먹밥","배고","프다",
                "우동","분식","떡볶이","튀김","김밥","토스트","와플","핫도그","분식이","이래도","되는가");
  $info["여학생휴게실"]=array("휴게실","여휴","여유");
  $info["와이파이"]=array("inu-wireles","inuyrs","에듀로","유플러스","eduroam","U+village","wifi","와이파이");
  $info["자판기"]=array("자판기");
  $info["제휴업체"]=array("제휴업체","제휴");
  $info["주차관리"]=array();
  $info["카페"]=array("쥬씨","스낵","스낵바","드림","JS","미유","그라지에","그라찌에","제과점","샐러디","팔공티","카페","마실","마실곳","마실수","커피","목말라");
  $info["편의점"]=array("gs","GS","지에스","지에스편의점","이마트","이마트편의점","CU","cu",
                        "씨유","씨유편의점","매점","편의점","매장","기념품","샵","기념품샵");

  return $info;
}

function keydata(){//인덱스가 입력되면 배열 안에 있는 단어와 문장의 교집합 단어를 출력
//  $info["빈강의실"]=array("강의실","빈강의실","빈","공부할 곳");
  $info["빈강의실"]=array();
  $info["놀이문화센터"]=array("대여물품"=>array("보드게임","보드","스케이트","자전거","배드민턴","게임","야구","노래방"));
  // $info["먹거리"]=array("토요일","일요일");
  $info["무인프린트"]=array("호관"=>array("5","6","7","8","12","13","14","15","17","18"."27"."28","29"),
  "건물명"=>array("자연","자연대","도서관","정보","정보대","공과","공과대","공대",
  "컨벤션","사회","사회대","글로벌","법정경","글로벌법정경","정경대","경대","법정경대","법대","경영","경영대",
  "인문","인문대","학생","회관","학생회관","생활원",
  "도시","도시대","실습관","생명","생명대"));
  $info["복지시설"]=array(
    "복지시설"=>array("주차관리소","주차관리","주차","관리","관리소","복사점","서점","우체국","문화","안경점","플스방",
    "신한","은행","신한은행","사진","사진관","휴대폰","휴대폰매장","유학사","유학","문방구","미용","미용실","보건소","보건","영화","영화관"),
    "건물명"=>array("도서관","본부","학생","생명"),
    "호관"=>array("1","6","11","17","29"));
  $info["음식점"]=array("분류"=>array("식당","휴게음식"),
                        "주말운영여부"=>array("휴점","토","토,일","주말"),
                        "매장명"=>array("교직원","학생","학식","식당","생활원","생활원식당","기식","카페테리아","샹차이","쌀국수","포썸","포썸쌀국수","봉구스","밥버거","봉구스밥버거","쉐푸드",
                                      "샐러디","고기","고집","토마토","도시락","버거","멜팅","멜팅버거","공씨네","주먹밥","공씨네주먹밥","김밥","팔뚝","분식","분식이","이래도","되는가","팔뚝","김밥","팔뚝김밥",
                                      "스낵","스낵바","토마토도시락","학생식당"),
                        "주메뉴"=>array("짜장면","짬뽕","탕수육","쌀국수","밥버거","덮밥","샐러드","고기","삼겹살","도시락","주스","주먹밥",
                                        "우동","분식","떡볶이","튀김","김밥","토스트","와플","핫도그")
                        );
  $info["여학생휴게실"]=array("수면실","샤워실","온돌","샤워실수면실");
  $info["와이파이"]=array("inu-wireless","eduroam","U+village","wifi","유플러스","inuyrs","에듀로");
  $info["자판기"]=array("커피","과자","음료","음료수");
  $info["제휴업체"]=array();
  $info["주차관리"]=array();
  $info["카페"]=array("매장명"=>array("쥬씨","스낵","스낵바","드림","JS","미유","그라지에","그라찌에","제과점","샐러디","팔공티"),"주말운영시간"=>array("토요일","일요일","휴점","주말"));
  $info["편의점"]=array("매장명"=>array("이마트","이마트편의점","자연대","자연대점","도서관","인문","공대","사회대","복지","기숙사","생명","미니","기념품","기념품샵"),
  "주말운영여부"=>array("주말","토","일"));

  return $info;
}


  function whdata(){
    $info["언제"]=array("언제","시간","지금","언제까지","몇시","시","시까지");
    $info["어디서"]=array("어디","어딨어","어디에","어디서","어딨");

    return $info;
  }

  function not_sql($string){
    $string=explode("_",$string);

    $info["인사"]=array("안녕","안녕하세요","하이","방가","헬로","감사합니다.");
    $info["교수님"]=array("교수님");
    $info["교수님이름"]=array("홍윤식","성미영","민병준","채진석","신봉희",
              "이면섭","최성욱","이선정","박종승","박문주","김우일","김지범","안재균","배승환","박재휘","백형부");


    if(array_intersect($info["인사"],$string)){
      $ran = mt_rand(0,3);
      $token = "인사";
      if($ran==0)
        return array($token,"안녕하세요");
      else if($ran==1)
        return array($token,"만나서 반가워요");
      else if($ran==2)
        return array($token,"안녕~!");
      else if($ran==3)
        return array($token,"저도 반가워용");

    }else if(array_intersect($info["교수님"],$string)){
      $token = "인사";
      if(array_intersect($string,$info["교수님이름"])){
        $a=array_intersect($string,$info["교수님이름"]);
        $a=implode("",$a);
      }else{
        $a="";
      }
      return array($token,$a."교수님 안녕하세요!");



    }else{
      $ran = mt_rand(0,3);
      $token = NULL;
      if($ran==0)
        return array($token,"뭐라구요?");
      else if($ran==1)
        return array($token,"죄송해요! 무슨 말인지 모르겠어요 ㅠㅠ");
      else if($ran==2)
        return array($token,"다시 한번 말해주세요!");
      else if($ran==3)
        return array($token,"뭐라는지 안들려요 ㅠㅠ");

    }

  }


 ?>
